2021-2023/TNCO/Packages/rfs_voicebundle_ansible/Contains/enum/Lifecycle/ansible/roles/provide/templates/nokia_enum_provide.xml.j2

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:typ="http://www.netnumber.com/titan/view/soap/types">
	<soapenv:Header/>
	<soapenv:Body>
		<typ:ChangeRequest view="{{ ENUM_ChangeRequest_view }}">
			<typ:entry>number='{{ GPSI }}' subscriber-id="{{ GPSI }}" rrid={{ ENUM_rrid }} NAPTR {ttl={{ ENUM_ttl }} order={{ ENUM_order }} preference={{ ENUM_preference }} flags="{{ ENUM_flags }}" service="{{ ENUM_service }}" regexp="!^(.*)$!sip:+{{ GPSI }};npdi@ims.mnc340.mcc313.3gppnetwork.org;user=phone!" replacement={{ ENUM_replacement }}}</typ:entry>
		</typ:ChangeRequest>
	</soapenv:Body>
</soapenv:Envelope>